Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/edc/PIC32MM0032GPL036.PIC
      <edc:SFRDef edc:_addr="0x1F802780" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNEN0B" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNEN0B" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE0B0" edc:desc="" edc:mask="0x1" edc:name="CNIE0B0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B1" edc:desc="" edc:mask="0x1" edc:name="CNIE0B1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B2" edc:desc="" edc:mask="0x1" edc:name="CNIE0B2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B3" edc:desc="" edc:mask="0x1" edc:name="CNIE0B3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B4" edc:desc="" edc:mask="0x1" edc:name="CNIE0B4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B5" edc:desc="" edc:mask="0x1" edc:name="CNIE0B5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B6" edc:desc="" edc:mask="0x1" edc:name="CNIE0B6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B7" edc:desc="" edc:mask="0x1" edc:name="CNIE0B7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B8" edc:desc="" edc:mask="0x1" edc:name="CNIE0B8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B9" edc:desc="" edc:mask="0x1" edc:name="CNIE0B9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B10" edc:desc="" edc:mask="0x1" edc:name="CNIE0B10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B11" edc:desc="" edc:mask="0x1" edc:name="CNIE0B11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B12" edc:desc="" edc:mask="0x1" edc:name="CNIE0B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B13" edc:desc="" edc:mask="0x1" edc:name="CNIE0B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B14" edc:desc="" edc:mask="0x1" edc:name="CNIE0B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B15" edc:desc="" edc:mask="0x1" edc:name="CNIE0B15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802790" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNSTATB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="CNSTATB" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATB0" edc:desc="" edc:mask="0x1" edc:name="CNSTATB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB1" edc:desc="" edc:mask="0x1" edc:name="CNSTATB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB2" edc:desc="" edc:mask="0x1" edc:name="CNSTATB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB3" edc:desc="" edc:mask="0x1" edc:name="CNSTATB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB4" edc:desc="" edc:mask="0x1" edc:name="CNSTATB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB5" edc:desc="" edc:mask="0x1" edc:name="CNSTATB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB6" edc:desc="" edc:mask="0x1" edc:name="CNSTATB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB7" edc:desc="" edc:mask="0x1" edc:name="CNSTATB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB8" edc:desc="" edc:mask="0x1" edc:name="CNSTATB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB9" edc:desc="" edc:mask="0x1" edc:name="CNSTATB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB10" edc:desc="" edc:mask="0x1" edc:name="CNSTATB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB11" edc:desc="" edc:mask="0x1" edc:name="CNSTATB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB12" edc:desc="" edc:mask="0x1" edc:name="CNSTATB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB13" edc:desc="" edc:mask="0x1" edc:name="CNSTATB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB14" edc:desc="" edc:mask="0x1" edc:name="CNSTATB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB15" edc:desc="" edc:mask="0x1" edc:name="CNSTATB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8027A0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNEN1B" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNEN1B" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE1B0" edc:desc="" edc:mask="0x1" edc:name="CNIE1B0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B1" edc:desc="" edc:mask="0x1" edc:name="CNIE1B1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B2" edc:desc="" edc:mask="0x1" edc:name="CNIE1B2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B3" edc:desc="" edc:mask="0x1" edc:name="CNIE1B3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B4" edc:desc="" edc:mask="0x1" edc:name="CNIE1B4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B5" edc:desc="" edc:mask="0x1" edc:name="CNIE1B5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B6" edc:desc="" edc:mask="0x1" edc:name="CNIE1B6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B7" edc:desc="" edc:mask="0x1" edc:name="CNIE1B7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B8" edc:desc="" edc:mask="0x1" edc:name="CNIE1B8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B9" edc:desc="" edc:mask="0x1" edc:name="CNIE1B9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B10" edc:desc="" edc:mask="0x1" edc:name="CNIE1B10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B11" edc:desc="" edc:mask="0x1" edc:name="CNIE1B11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B12" edc:desc="" edc:mask="0x1" edc:name="CNIE1B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B13" edc:desc="" edc:mask="0x1" edc:name="CNIE1B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B14" edc:desc="" edc:mask="0x1" edc:name="CNIE1B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B15" edc:desc="" edc:mask="0x1" edc:name="CNIE1B15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8027B0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNFB" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNFB" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFB0" edc:desc="" edc:mask="0x1" edc:name="CNFB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB1" edc:desc="" edc:mask="0x1" edc:name="CNFB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB2" edc:desc="" edc:mask="0x1" edc:name="CNFB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB3" edc:desc="" edc:mask="0x1" edc:name="CNFB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB4" edc:desc="" edc:mask="0x1" edc:name="CNFB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB5" edc:desc="" edc:mask="0x1" edc:name="CNFB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB6" edc:desc="" edc:mask="0x1" edc:name="CNFB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB7" edc:desc="" edc:mask="0x1" edc:name="CNFB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB8" edc:desc="" edc:mask="0x1" edc:name="CNFB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB9" edc:desc="" edc:mask="0x1" edc:name="CNFB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB10" edc:desc="" edc:mask="0x1" edc:name="CNFB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB11" edc:desc="" edc:mask="0x1" edc:name="CNFB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB12" edc:desc="" edc:mask="0x1" edc:name="CNFB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB13" edc:desc="" edc:mask="0x1" edc:name="CNFB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB14" edc:desc="" edc:mask="0x1" edc:name="CNFB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB15" edc:desc="" edc:mask="0x1" edc:name="CNFB15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8027C0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SR0B" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0ffff" edc:ishidden="true" edc:isidehidden="true" edc:isindirect="false" edc:islanghidden="true" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SR0B" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0B0" edc:desc="" edc:mask="0x1" edc:name="SR0B0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B1" edc:desc="" edc:mask="0x1" edc:name="SR0B1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B2" edc:desc="" edc:mask="0x1" edc:name="SR0B2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B3" edc:desc="" edc:mask="0x1" edc:name="SR0B3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B4" edc:desc="" edc:mask="0x1" edc:name="SR0B4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B5" edc:desc="" edc:mask="0x1" edc:name="SR0B5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B6" edc:desc="" edc:mask="0x1" edc:name="SR0B6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B7" edc:desc="" edc:mask="0x1" edc:name="SR0B7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B8" edc:desc="" edc:mask="0x1" edc:name="SR0B8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B9" edc:desc="" edc:mask="0x1" edc:name="SR0B9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B10" edc:desc="" edc:mask="0x1" edc:name="SR0B10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B11" edc:desc="" edc:mask="0x1" edc:name="SR0B11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B12" edc:desc="" edc:mask="0x1" edc:name="SR0B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B13" edc:desc="" edc:mask="0x1" edc:name="SR0B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B14" edc:desc="" edc:mask="0x1" edc:name="SR0B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B15" edc:desc="" edc:mask="0x1" edc:name="SR0B15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8027D0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SR1B" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0ffff" edc:ishidden="true" edc:isidehidden="true" edc:isindirect="false" edc:islanghidden="true" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SR1B" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1B0" edc:desc="" edc:mask="0x1" edc:name="SR1B0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B1" edc:desc="" edc:mask="0x1" edc:name="SR1B1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B2" edc:desc="" edc:mask="0x1" edc:name="SR1B2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B3" edc:desc="" edc:mask="0x1" edc:name="SR1B3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B4" edc:desc="" edc:mask="0x1" edc:name="SR1B4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B5" edc:desc="" edc:mask="0x1" edc:name="SR1B5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B6" edc:desc="" edc:mask="0x1" edc:name="SR1B6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B7" edc:desc="" edc:mask="0x1" edc:name="SR1B7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B8" edc:desc="" edc:mask="0x1" edc:name="SR1B8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B9" edc:desc="" edc:mask="0x1" edc:name="SR1B9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B10" edc:desc="" edc:mask="0x1" edc:name="SR1B10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B11" edc:desc="" edc:mask="0x1" edc:name="SR1B11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B12" edc:desc="" edc:mask="0x1" edc:name="SR1B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B13" edc:desc="" edc:mask="0x1" edc:name="SR1B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B14" edc:desc="" edc:mask="0x1" edc:name="SR1B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B15" edc:desc="" edc:mask="0x1" edc:name="SR1B15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
