Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/edc/PIC32MM0032GPL036.PIC
      <edc:SFRDef edc:_addr="0x1F8028C0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="10" edc:access="----------------------nn----nnnn" edc:cname="SR0C" edc:desc="" edc:grp="PORTC" edc:impl="0xffc0030f" edc:ishidden="true" edc:isidehidden="true" edc:isindirect="false" edc:islanghidden="true" edc:isvolatile="true" edc:mclr="----------------------00----0000" edc:name="SR0C" edc:nzwidth="0x20" edc:por="----------------------00----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0C0" edc:desc="" edc:mask="0x1" edc:name="SR0C0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C1" edc:desc="" edc:mask="0x1" edc:name="SR0C1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C2" edc:desc="" edc:mask="0x1" edc:name="SR0C2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C3" edc:desc="" edc:mask="0x1" edc:name="SR0C3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0C8" edc:desc="" edc:mask="0x1" edc:name="SR0C8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C9" edc:desc="" edc:mask="0x1" edc:name="SR0C9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8028D0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="10" edc:access="----------------------nn----nnnn" edc:cname="SR1C" edc:desc="" edc:grp="PORTC" edc:impl="0xffc0030f" edc:ishidden="true" edc:isidehidden="true" edc:isindirect="false" edc:islanghidden="true" edc:isvolatile="true" edc:mclr="----------------------00----0000" edc:name="SR1C" edc:nzwidth="0x20" edc:por="----------------------00----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1C0" edc:desc="" edc:mask="0x1" edc:name="SR1C0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C1" edc:desc="" edc:mask="0x1" edc:name="SR1C1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C2" edc:desc="" edc:mask="0x1" edc:name="SR1C2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C3" edc:desc="" edc:mask="0x1" edc:name="SR1C3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1C8" edc:desc="" edc:mask="0x1" edc:name="SR1C8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C9" edc:desc="" edc:mask="0x1" edc:name="SR1C9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8028E0" edc:offset="0x320"/>
      <edc:SFRDef edc:_addr="0x1F802C00" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="11" edc:access="--------------------n-----------" edc:cname="PMDCON" edc:desc="" edc:impl="0x800" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------0-----------" edc:name="PMDCON" edc:nzwidth="32" edc:por="--------------------0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="10"/>
            <edc:SFRFieldDef edc:cname="PMDLOCK" edc:desc="" edc:mask="0x1" edc:name="PMDLOCK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C10" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="11" edc:access="-----------n-------n-----------n" edc:cname="PMD1" edc:desc="" edc:impl="0x101001" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------0-------0-----------0" edc:name="PMD1" edc:nzwidth="32" edc:por="-----------0-------0-----------0" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCMD" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="VREFMD" edc:desc="" edc:mask="0x1" edc:name="VREFMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="HLVDMD" edc:desc="" edc:mask="0x1" edc:name="HLVDMD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C20" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="11" edc:access="------nn----------------------nn" edc:cname="PMD2" edc:desc="" edc:impl="0x3000003" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00----------------------00" edc:name="PMD2" edc:nzwidth="32" edc:por="------00----------------------00" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="22"/>
            <edc:SFRFieldDef edc:cname="CLC1MD" edc:desc="" edc:mask="0x1" edc:name="CLC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLC2MD" edc:desc="" edc:mask="0x1" edc:name="CLC2MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C30" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="11" edc:access="---------------------nnn--------" edc:cname="PMD3" edc:desc="" edc:impl="0x700" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------000--------" edc:name="PMD3" edc:nzwidth="32" edc:por="---------------------000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CCP1MD" edc:desc="" edc:mask="0x1" edc:name="CCP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCP2MD" edc:desc="" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCP3MD" edc:desc="" edc:mask="0x1" edc:name="CCP3MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C40" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="11" edc:access="-------------------------------n" edc:cname="PMD4" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="PMD4" edc:nzwidth="32" edc:por="-------------------------------0" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C50" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="11" edc:access="--------------nn------nn------nn" edc:cname="PMD5" edc:desc="" edc:impl="0x30303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00------00------00" edc:name="PMD5" edc:nzwidth="32" edc:por="--------------00------00------00" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MD" edc:desc="" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C60" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="11" edc:access="-----------------------n-------n" edc:cname="PMD6" edc:desc="" edc:impl="0x101" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------0-------0" edc:name="PMD6" edc:nzwidth="32" edc:por="-----------------------0-------0" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RTCCMD" edc:desc="" edc:mask="0x1" edc:name="RTCCMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="REFOMD" edc:desc="" edc:mask="0x1" edc:name="REFOMD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C70" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="11" edc:access="----------------------------n---" edc:cname="PMD7" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0---" edc:name="PMD7" edc:nzwidth="32" edc:por="----------------------------0---" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CRCMD" edc:desc="" edc:mask="0x1" edc:name="CRCMD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802C80" edc:offset="0xe80"/>
      <edc:SFRDef edc:_addr="0x1F803B00" edc:_begin="0x390" edc:_end="0x3a0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="12" edc:access="--------nnnnnnnn------------n---" edc:cname="CFGCON" edc:desc="" edc:impl="0xff0008" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000------------0---" edc:name="CFGCON" edc:nzwidth="0x20" edc:por="--------00000000------------0---" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="JTAGEN" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="EXECADDR" edc:mask="0xff" edc:name="EXECADDR" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F803B10" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F803B20" edc:_begin="0x3a0" edc:_end="0x3c0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="13" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVID" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DEVID" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MAINID" edc:mask="0xfff" edc:name="MAINID" edc:nzwidth="0xc"/>
            <edc:SFRFieldDef edc:cname="PN" edc:mask="0xffff" edc:name="PN" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="VER" edc:mask="0xf" edc:name="VER" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
